api/app/controllers/api/tasks_controller.rb

SELECT `tasks`.* FROM `tasks`
---
  def index
      @tasks = Task.all

INSERT INTO `tasks` (`text`, `created_at`, `updated_at`) VALUES ('洗濯する', '2021-08-04 07:27:32.129903', '2021-08-04 07:27:32.129903')
---
    def create
      @task = Task.new(task_params)
      if @task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 1
---
    def destroy
      @task = Task.find(params[:id])
      @task.destroy